trade_exp/src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриходныйКассовыйОрдер</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоверенностьВыданная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВТомЧислеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПринятоОт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РаспоряжениеНаПеремещениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДеньгиВнесеныCотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникВнесшийДеньги</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8883b2d0-a5b9-4340-ba78-26c65139acc4">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0a1c1d55-366e-43cb-8439-93ee576690ae">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58f144c7-5fda-443f-9eba-f223e9943695">
    <name>КратностьКурсаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cff8f06f-bc4b-4e6b-9b4d-5950964e2129">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="10fa07b1-5a87-4461-aa12-363a0e2dcbe0">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aba486ff-7913-419f-a30a-54e7051d8781">
      <name>НастройкаСчетовУчета</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb507992-a434-4b87-b5fc-2dedaaad5197">
      <name>ДоговорАренды</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="791145c7-c177-49dd-9f53-9f6842c3a1bd">
      <name>ТипПлатежаПоАренде</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ea2e5a37-549f-4567-b4af-235dd476e2cc">
      <name>РасчетныйДокументПоАренде</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b8195c88-ac4b-4fc2-a1c7-dceb6683e8f4">
      <name>КурсЗнаменательВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3dea0088-c6d9-458f-b093-d64eb55cdffd">
      <name>КурсЧислительВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c61a3692-b940-4015-bb16-55fe766bad68">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5572011c-09eb-401f-83fd-579e97ce4bda">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6ae13040-3ec8-4088-b96f-0f527dab3086">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1db7c744-182b-48e1-93fd-95d6c880eaf2">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/CommonModules/ФормированиеФискальныхЧековКлиент/Module.bsl
&ИзменениеИКонтроль("ФискальнаяОперацияОбработкаНавигационнойСсылки")
Процедура Док_ФискальнаяОперацияОбработкаНавигационнойСсылки(Форма, НавигационнаяСсылка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыФискализации = ОбщегоНазначенияУТКлиентСервер.ПолучитьДанныеМеханизмаИзКэшаФормы(Форма, "РозничныеПродажи");

	Если "ПробитьЧек" = НавигационнаяСсылка Тогда
		#Вставка
		Документ = Форма.Объект;
		Если ФормированиеФискальныхЧековВызовСервера.МожноПробивать(Документ) Тогда
		#КонецВставки
			ФормированиеФискальныхЧековКлиент.ОтобразитьЧек(
			Форма,
			Новый ОписаниеОповещения("ФискальнаяОперацияЗавершение", Форма));
		#Вставка
		Иначе
			Сообщить("Нельзя пробивать документы не сегодняшней датой");
			ФормированиеФискальныхЧековВызовСервера.СообщитьОПробитии(форма.объект.Ссылка);
		КонецЕсли;
		#КонецВставки

	ИначеЕсли "ПробитьЧекИнкассацияВыемка" = НавигационнаяСсылка Тогда

		ОборудованиеПодключенноеПоТорговомуОбъекту = ПодключаемоеОборудованиеУТВызовСервера.ОборудованиеПодключенноеПоТорговомуОбъектуВзаимодействующееОнлайнС1С(ПараметрыФискализации.ТорговыйОбъект);
		Если ОборудованиеПодключенноеПоТорговомуОбъекту.ККТ.Количество() = 1 Тогда
			ПараметрыФискализации.Вставить("ПодключенноеОборудование", ОборудованиеПодключенноеПоТорговомуОбъекту.ККТ[0]);
		КонецЕсли;

		ДополнительныеПараметрыОповещения = Новый Структура("РезультатВыполненияФискальнойОперации,СсылкаНаДокумент", Неопределено, Неопределено);

		ПодключаемоеОборудованиеУТКлиент.ПробитьЧекВыемкаДенежныхСредств(
		Форма,
		ПараметрыФискализации,
		РежимЗаписиДокумента.Проведение,
		Новый ОписаниеОповещения("ФискальнаяОперацияЗавершение", Форма, ДополнительныеПараметрыОповещения));

	ИначеЕсли "ПробитьЧекИнкассацияВнесение" = НавигационнаяСсылка Тогда

		ОборудованиеПодключенноеПоТорговомуОбъекту = ПодключаемоеОборудованиеУТВызовСервера.ОборудованиеПодключенноеПоТорговомуОбъектуВзаимодействующееОнлайнС1С(ПараметрыФискализации.ТорговыйОбъект);
		Если ОборудованиеПодключенноеПоТорговомуОбъекту.ККТ.Количество() = 1 Тогда
			ПараметрыФискализации.Вставить("ПодключенноеОборудование", ОборудованиеПодключенноеПоТорговомуОбъекту.ККТ[0]);
		КонецЕсли;

		ДополнительныеПараметрыОповещения = Новый Структура("РезультатВыполненияФискальнойОперации,СсылкаНаДокумент", Неопределено, Неопределено);

		ПодключаемоеОборудованиеУТКлиент.ПробитьЧекВнесениеДенежныхСредств(
		Форма,
		ПараметрыФискализации,
		РежимЗаписиДокумента.Проведение,
		Новый ОписаниеОповещения("ФискальнаяОперацияЗавершение", Форма, ДополнительныеПараметрыОповещения));

	ИначеЕсли "ОткрытьЗаписьФискальнойОперации" = НавигационнаяСсылка Тогда

		ПодключаемоеОборудованиеУТКлиент.ОткрытьЗаписьФискальнойОперации(Форма, Форма.Объект.Ссылка);

	ИначеЕсли "НастроитьОборудование" = НавигационнаяСсылка Тогда

		ОткрытьФорму("Обработка.ПредпросмотрЧека.Форма.ОшибкаПодключенияККТ");

	КонецЕсли;

КонецПроцедуры


&ИзменениеИКонтроль("ШтрихкодыУпаковокПоДокументамЗаполнены")
	Функция Док_ШтрихкодыУпаковокПоДокументамЗаполнены(Форма, ДополнительныеПараметры)
	#Удаление
	Результат = Истина;

	ДокументыРеализации = Новый Массив;
	Если Форма.ИмяФормы = "Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ОперацияПоПлатежнойКарте.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.ПоступлениеБезналичныхДенежныхСредств.Форма.ФормаДокумента" Тогда

		Для Каждого СтрокаРасшифровкиПлатежа Из Форма.Объект.РасшифровкаПлатежа Цикл

			Если ТипЗнч(СтрокаРасшифровкиПлатежа.ОбъектРасчетов) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ДокументыРеализации.Добавить(СтрокаРасшифровкиПлатежа.ОбъектРасчетов);
				Продолжить;
			КонецЕсли;

			Если ТипЗнч(СтрокаРасшифровкиПлатежа.ОснованиеПлатежа) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ДокументыРеализации.Добавить(СтрокаРасшифровкиПлатежа.ОснованиеПлатежа);
				Продолжить;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Если НЕ ФормированиеФискальныхЧековВызовСервера.ШтрихкодыУпаковокПоДокументамЗаполнены(ДокументыРеализации) Тогда
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;
	#КонецУдаления
	#Вставка
	Возврат Истина
	#КонецВставки
КонецФункции
